og_bench/opengauss_oltp_point_select_threads_8_time_60_tables_4_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_point_select --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=4 --table-size=1000000 prepare >> opengauss_oltp_point_select_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest2'...
Creating table 'sbtest3'...
Creating table 'sbtest1'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest4'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest3'
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest3'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_point_select --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=4 --table-size=1000000 run >> opengauss_oltp_point_select_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 35478.95 qps: 35478.95 (r/w/o: 35478.95/0.00/0.00) lat (ms,95%): 0.63 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 44572.45 qps: 44572.45 (r/w/o: 44572.45/0.00/0.00) lat (ms,95%): 0.36 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 43721.47 qps: 43721.47 (r/w/o: 43721.47/0.00/0.00) lat (ms,95%): 0.37 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 41620.61 qps: 41620.61 (r/w/o: 41620.61/0.00/0.00) lat (ms,95%): 0.39 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 44935.12 qps: 44935.12 (r/w/o: 44935.12/0.00/0.00) lat (ms,95%): 0.35 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 46985.13 qps: 46985.13 (r/w/o: 46985.13/0.00/0.00) lat (ms,95%): 0.32 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2573307
        write:                           0
        other:                           0
        total:                           2573307
    transactions:                        2573307 (42879.68 per sec.)
    queries:                             2573307 (42879.68 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0117s
    total number of events:              2573307

Latency (ms):
         min:                                    0.02
         avg:                                    0.19
         max:                                  106.79
         95th percentile:                        0.39
         sum:                               478365.66

Threads fairness:
    events (avg/stddev):           321663.3750/1673.14
    execution time (avg/stddev):   59.7957/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=4 --table-size=1000000 cleanup>> opengauss_oltp_point_select_threads_8_time_60_tables_4_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...