og_bench/opengauss_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_only --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 prepare >> opengauss_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Initializing worker threads...

Creating table 'sbtest1'...
Creating table 'sbtest2'...
Creating table 'sbtest5'...
Creating table 'sbtest8'...
Creating table 'sbtest7'...
Creating table 'sbtest3'...
Creating table 'sbtest6'...
Creating table 'sbtest4'...
Inserting 1000000 records into 'sbtest3'
Inserting 1000000 records into 'sbtest7'
Inserting 1000000 records into 'sbtest6'
Inserting 1000000 records into 'sbtest1'
Inserting 1000000 records into 'sbtest2'
Inserting 1000000 records into 'sbtest4'
Inserting 1000000 records into 'sbtest8'
Inserting 1000000 records into 'sbtest5'
Creating a secondary index on 'sbtest6'...
Creating a secondary index on 'sbtest5'...
Creating a secondary index on 'sbtest4'...
Creating a secondary index on 'sbtest3'...
Creating a secondary index on 'sbtest1'...
Creating a secondary index on 'sbtest2'...
Creating a secondary index on 'sbtest7'...
Creating a secondary index on 'sbtest8'...
sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_read_only --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 run >> opengauss_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1174.69 qps: 18802.32 (r/w/o: 16452.13/0.00/2350.19) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1339.73 qps: 21437.84 (r/w/o: 18758.39/0.00/2679.46) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1312.92 qps: 21002.02 (r/w/o: 18376.18/0.00/2625.84) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1404.02 qps: 22467.53 (r/w/o: 19659.49/0.00/2808.04) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1494.99 qps: 23916.57 (r/w/o: 20926.60/0.00/2989.97) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1189.49 qps: 19033.07 (r/w/o: 16654.30/0.00/2378.77) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1108366
        write:                           0
        other:                           158338
        total:                           1266704
    transactions:                        79169  (1319.14 per sec.)
    queries:                             1266704 (21106.20 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0147s
    total number of events:              79169

Latency (ms):
         min:                                    1.19
         avg:                                    6.06
         max:                                  173.17
         95th percentile:                       11.45
         sum:                               479701.35

Threads fairness:
    events (avg/stddev):           9896.1250/54.35
    execution time (avg/stddev):   59.9627/0.00

sysbench --threads=8 --time=60 --report-interval=10 --db-driver=pgsql oltp_delete --pgsql-host=localhost --pgsql-port=5432 --pgsql-user=sbtest --pgsql-password=Wzh@0401 --pgsql-db=sbtest --tables=8 --table-size=1000000 cleanup>> opengauss_oltp_read_only_threads_8_time_60_tables_8_table_size_1000000.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Dropping table 'sbtest1'...
Dropping table 'sbtest2'...
Dropping table 'sbtest3'...
Dropping table 'sbtest4'...
Dropping table 'sbtest5'...
Dropping table 'sbtest6'...
Dropping table 'sbtest7'...
Dropping table 'sbtest8'...